module.exports.config = {
name: 'autosent',
version: '10.02',
hasPermssion: 0,
credits: 'NAWAZ AHMAD',
description: 'Set Karne Ke Bad Automatically Msg Send Karega',
commandCategory: 'group messenger',
usages: '[]',
cooldowns: 3
};
const nam = [{
timer: '12:00:00 AM',
message: ['──── •💜• ────                𝐀𝐛𝐡𝐢 𝐓𝐢𝐦𝐞 𝐇𝐚𝐢 10:00 P𝐌 ⏳            کیا میں نے کبھی سوچا تھا کہ خوابوں کا پیچھا کرتے ہوئے میں خود کو کھو دوں گا؟\n مگر یہ کیا، جب میں نے خود کو پایا تو سارے خواب کہیں کھو گئے۔                 ──── •💜• ────»»𝐎𝐖𝐍𝐄𝐑««★𝐓𝐀𝐇𝐀 𝐁𝐀𝐁𝐔★']
},
{
timer: '1:00:00 AM',
message: ['──── •💜• ────     𝐀𝐛𝐡𝐢 𝐓𝐢𝐦𝐞 𝐡𝐚𝐢 11:00 𝗔𝐌 ⏳           دلوں میں تنہائی ہے,\n پھر بھی امیدیں ہمیشہ دل کو زندہ رکھتی ہیں۔\n جو سیدھی راہ پر چلے گا وہ ضرور کچھ روشنی پائے گا۔              ──── •💜• ────»»𝐎𝐖𝐍𝐄𝐑««★𝐓𝐀𝐇𝐀 𝐁𝐀𝐁𝐔★']
},
{
timer: '2:00:00 AM',
message: ['──── •💜• ────                𝐀𝐛𝐡𝐢 𝐓𝐢𝐦𝐞 𝐡𝐚𝐢 12:00 A𝐌 ⏳             جب ہم گرتے ہیں تو دنیا کی نظروں میں ہماری قدر بڑھ جاتی ہے۔,\nکیونکہ یہ ہمیں دوبارہ کھڑے ہونے کی طاقت دیتا ہے۔          ──── •💜• ────»»𝐎𝐖𝐍𝐄𝐑««★𝐓𝐀𝐇𝐀 𝐁𝐀𝐁𝐔★']
},
{
timer: '3:00:00 AM',
message: ['──── •💜• ────                𝐀𝐛𝐡𝐢 𝐓𝐢𝐦𝐞 𝐡𝐚𝐢 1:00 A𝐌 ⏳             ہم جو چاہتے ہیں وہ آسانی سے نہیں ملتا\n لیکن جب ہم محنت اور صبر حاصل کرتے ہیں تو یہ سب سے قیمتی ہوتا ہے۔ہم جو چاہتے ہیں وہ آسانی سے نہیں ملتا\n لیکن جب ہم محنت اور صبر حاصل کرتے ہیں تو یہ سب سے قیمتی ہوتا ہے۔              ──── •💜• ────»»𝐎𝐖𝐍𝐄𝐑««★𝐓𝐀𝐇𝐀 𝐁𝐀𝐁𝐔★']
},
{
timer: '4:00:00 AM',
message: ['──── •💜• ────                𝐀𝐛𝐡𝐢 𝐓𝐢𝐦𝐞 𝐡𝐚𝐢 2:00 A𝐌 ⏳              تنہائی میں خود کو کبھی تنہا مت سمجھو\n کیونکہ دنیا کا سب سے بڑا دوست آپ کا خود اعتمادی ہے۔          ──── •💜• ────»»𝐎𝐖𝐍𝐄𝐑««★𝐓𝐀𝐇𝐀 𝐁𝐀𝐁𝐔★']
},
{
timer: '5:00:00 AM',
message: ['──── •💜• ────                𝐀𝐛𝐡𝐢 𝐓𝐢𝐦𝐞 𝐡𝐚𝐢 3:00 A𝐌 ⏳ ہر شخص کے دل میں ایک کہانی ہے\n جسے کبھی کوئی نہیں جانتا،\nکیونکہ وہ کہانی صرف اس شخص کے دل میں رہتی ہے۔\n.      ──── •💜• ────»»𝐎𝐖𝐍𝐄𝐑««★𝐓𝐀𝐇𝐀 𝐁𝐀𝐁𝐔★']
},
{
timer: '6:00:00 AM',
message: ['──── •💜• ────                𝐀𝐛𝐡𝐢 𝐓𝐢𝐦𝐞 𝐡𝐚𝐢 4:00 𝗔𝐌 ⏳            ہر موڑ پر نیا رستہ ڈھونڈتا ہوں\n کیونکہ میں ان راستوں پر نہیں چلتا جو پہلے سے طے شدہ ہوں۔             ──── •💜• ────»»𝐎𝐖𝐍𝐄𝐑««★𝐓𝐀𝐇𝐀 𝐁𝐀𝐁𝐔★']
},
{
timer: '7:00:00 AM',
message: ['──── •💜• ────                𝐀𝐛𝐡𝐢 𝐓𝐢𝐦𝐞 𝐡𝐚𝐢 5:00 A𝐌 ⏳             خوش رہنا اور مسکرانا سب سے بڑی طاقت ہے\n کیونکہ یہ درد کو کم کرتا ہے اور زندگی کو آسان بناتا ہے۔🕊️                 ──── •💜• ────»»𝐎𝐖𝐍𝐄𝐑««★𝐓𝐀𝐇 𝐁𝐀𝐁𝐔★']
},
{
timer: '8:00:00 AM',
message: ['──── •💜• ────                𝐀𝐛𝐡𝐢 𝐓𝐢𝐦𝐞 𝐡𝐚𝐢 6:00 A𝐌 ⏳            زندگی میں مشکلیں آتی ہیں، لیکن اگر ہم ان کے ساتھ ہنستے ہوئے چلیں تو وہ ہمیں کبھی ہارنے نہیں دیتے۔                  ──── •💜• ────»»𝐎𝐖𝐍𝐄𝐑««★𝐓𝐀𝐇𝐀 𝐁𝐀𝐁𝐔★']
},
{
timer: '9:00:00 AM',
message: ['──── •💜• ────                𝐀𝐛𝐡𝐢 𝐓𝐢𝐦𝐞 𝐡𝐚𝐢 7:00 A𝐌 ⏳            اچھے برے وقت کا ملنا کسی کے بس میں نہیں ہوتا\n لیکن جو اسے قبول کرتا ہے وہی حقیقی فاتح ہے۔                ──── •💜• ────»»𝐎𝐖𝐍𝐄𝐑««★𝐓𝐀𝐇𝐀 𝐁𝐀𝐁𝐔★']
},
{
timer: '10:00:00 AM',
message: ['──── •💜• ────                𝐀𝐛𝐡𝐢 𝐓𝐢𝐦𝐞 𝐡𝐚𝐢 8:00 A𝐌 ⏳           زندگی کی سب سے اچھی بات یہ ہے کہ وقت جو بھی گزر جائے\n وہ کبھی واپس نہیں آتا، اس لیے جتنا ہو سکے جیو۔",──── •💜• ────»»𝐎𝐖𝐍𝐄𝐑««★𝐓𝐀𝐇𝐀 𝐁𝐀𝐁𝐔★']
},
{
timer: '11:00:00 AM',
message: ['──── •💜• ────                𝐀𝐛𝐡𝐢 𝐓𝐢𝐦𝐞 𝐡𝐚𝐢 9:00 A𝐌 ⏳            لوگ اکثر مجھے خوش رہنے کو کہتے ہیں۔,\n لیکن ان کی سمجھ میں نہیں آتا کہ مسکراہٹ کے پیچھے کتنی کہانیاں چھپی ہیں۔               ──── •💜• ────»»𝐎𝐖𝐍𝐄𝐑««★𝐓𝐀𝐇𝐀 𝐁𝐀𝐁𝐔★']
},
{
timer: '12:00:00 PM',
message: ['──── •💜• ────                𝐀𝐛𝐡𝐢 𝐓𝐢𝐦𝐞 𝐡𝐚𝐢 10:00 A𝐌 ⏳            ہمیں چھوڑنے والے،\n ہم ان کے بغیر بھی جی سکتے ہیں\n لیکن جو دل سے جڑے رہتے ہیں وہ کبھی نہیں جاتے۔               ──── •💜• ────»»𝐎𝐖𝐍𝐄𝐑««★𝐓𝐀𝐇𝐀 𝐁𝐀𝐁𝐔★']
},
{
timer: '1:00:00 PM',
message: ['──── •💜• ────                𝐀𝐛𝐡𝐢 𝐓𝐢𝐦𝐞 𝐡𝐚𝐢 11:00 𝐏𝐌 ⏳            کبھی کبھی ہماری خاموشی ہماری سب سے بڑی آواز بن جاتی ہے\n کیونکہ اس آواز میں سچائی اور درد ہے۔            ──── •💜• ────»»𝐎𝐖𝐍𝐄𝐑««★𝐓𝐀𝐇𝐀 𝐁𝐀𝐁𝐔★']
},
{
timer: '2:00:00 PM',
message: ['──── •💜• ────                𝐀𝐛𝐡𝐢 𝐓𝐢𝐦𝐞 𝐡𝐚𝐢 12:00 𝐏𝐌 ⏳            زندگی کی راہیں آسان نہیں\n ہر کسی کا دل کبھی نہ کبھی ٹوٹتا ہے\n لیکن جو دل ٹوٹا اور جڑا ہو وہ سب سے مضبوط ہوتا ہے۔                 ──── •💜• ────»»𝐎𝐖𝐍𝐄𝐑««★𝐓𝐀𝐇𝐀 𝐁𝐀𝐁𝐔★']
},
{
timer: '3:00:00 PM',
message: ['──── •💜• ────                𝐀𝐛𝐡𝐢 𝐓𝐢𝐦𝐞 𝐡𝐚𝐢 1:00 𝐏𝐌 ⏳            امید کے بارے میں کیا، یہ ہر روز ٹوٹتا ہے اور پھر سے بڑھتا ہے۔\n بس اسے پکڑو یہاں تک کہ جب وہ گرے، کیونکہ یہ تمہاری طاقت ہے۔                   ──── •💜• ────»»𝐎𝐖𝐍𝐄𝐑««★𝐓𝐀𝐇𝐀 𝐁𝐀𝐁𝐔★']
},
{
timer: '4:00:00 PM',
message: ['──── •💜• ────                𝐀𝐛𝐡𝐢 𝐓𝐢𝐦𝐞 𝐡𝐚𝐢 2:00 𝐏𝐌 ⏳                 انسان اپنے حالات کا پابند نہیں ہوتا\n آپ کی نیت سے بڑا ہے۔\n جو کبھی ہار نہیں مانتا وہی سب سے زیادہ جیتتا ہے۔                     ──── •💜• ────»»𝐎𝐖𝐍𝐄𝐑««★𝐓𝐀𝐇𝐀 𝐁𝐀𝐁𝐔★']
},
{
timer: '5:00:00 PM',
message: ['──── •💜• ────                𝐀𝐛𝐡𝐢 𝐓𝐢𝐦𝐞 𝐡𝐚𝐢 3:00 𝐏𝐌 ⏳            جو اپنے خواب پورے دل سے جیتا ہے\n وہ اپنی زندگی میں کبھی ہار نہیں سکتا۔\n شکست صرف وہی لوگ قبول کرتے ہیں جو اپنی امیدیں چھوڑ دیتے ہیں۔                       ──── •💜• ────»»𝐎𝐖𝐍𝐄𝐑««★𝐓𝐀𝐇𝐀 𝐁𝐀𝐁𝐔★']
},
{
timer: '6:00:00 PM',
message: ['──── •💜• ────                𝐀𝐛𝐡𝐢 𝐓𝐢𝐦𝐞 𝐡𝐚𝐢 4:00 𝐏𝐌 ⏳                 زندگی بہت مختصر ہے،\n لیکن بعض اوقات ہم اپنے خوابوں کو پورا کرنے میں اتنی دیر لگا دیتے ہیں کہ ہم جینے کا صحیح طریقہ بھول جاتے ہیں۔              ──── •💜• ────»»𝐎𝐖𝐍𝐄𝐑««★𝐓𝐀𝐇𝐀 𝐁𝐀𝐁𝐔★']
},
{
timer: '7:00:00 PM',
message: ['──── •💜• ────                𝐀𝐛𝐡𝐢 𝐓𝐢𝐦𝐞 𝐡𝐚𝐢 5:00 𝐏𝐌 ⏳             ہمیشہ یاد رکھنا،\n دکھ اور خوشی دونوں وقت کی طرح ہیں۔\n جب ایک آتا ہے تو دوسرا بھی جلد آتا ہے۔\n اس لیے کبھی تنہا محسوس نہ کریں۔                ──── •💜• ────»»𝐎𝐖𝐍𝐄𝐑««★𝐓𝐀𝐇𝐀 𝐁𝐀𝐁𝐔★']
},
{
timer: '8:00:00 PM',
message: ['──── •💜• ────                𝐀𝐛𝐡𝐢 𝐓𝐢𝐦𝐞 𝐡𝐚𝐢 6:00 𝐏𝐌 ⏳             جو گزر گیا اسے بھول جاؤ\n ابھی کیا ہے اس پر توجہ دیں۔\n آج آپ کی محنت کی وجہ سے،\n وہ آپ کے کل کا چہرہ بنائے گی۔               ──── •💜• ────»»𝐎𝐖𝐍𝐄𝐑««★𝐓𝐀𝐇𝐀 𝐁𝐀𝐁𝐔★']
},
{
timer: '9:00:00 PM',
message: ['──── •💜• ────                𝐀𝐛𝐡𝐢 𝐓𝐢𝐦𝐞 𝐡𝐚𝐢 7:00 𝐏𝐌 ⏳              انسان خود کو اسی دن سمجھتا ہے\n جس دن وہ دوسروں کے بارے میں سوچنا چھوڑ دیتا ہے۔\n کیونکہ دوسروں کے بارے میں سوچتے ہوئے ہم اپنے آپ کو کھو دیتے ہیں۔🕊️                                ──── •💜• ────»»𝐎𝐖𝐍𝐄𝐑««★𝐓𝐀𝐇𝐀 𝐁𝐀𝐁𝐔★']
},
{
timer: '10:00:00 PM',
message: ['──── •💜• ────                𝐀𝐛𝐡𝐢 𝐓𝐢𝐦𝐞 𝐡𝐚𝐢 8:00 𝐏𝐌 ⏳                  زندگی کی سب سے بڑی سزا\n کسی کو دل سے پیار کرنے کے بعد اسے کھونا پڑتا ہے۔\n لیکن یہ وہ وقت ہوتا ہے جب انسان سب سے مضبوط ہوتا ہے۔                 ──── •💜• ────»»𝐎𝐖𝐍𝐄𝐑««★𝐓𝐀𝐇𝐀 𝐁𝐀𝐁𝐔★']
},
{
timer: '11:00:00 PM',
message: ['──── •💜• ────                𝐀𝐛𝐡𝐢 𝐓𝐢𝐦𝐞 𝐡𝐚𝐢 9:00 P𝐌 ⏳              زندگی میں ہمیشہ خوش رہنے کی کوشش کرو\n کیونکہ جب آپ خوش ہوتے ہیں تو دنیا آپ کے ساتھ ہوتی ہے۔\n اور جب آپ اداس ہوتے ہیں تو دنیا بھی چلی جاتی ہے۔                     ──── •💜• ────»»𝐎𝐖𝐍𝐄𝐑««★𝐓𝐀𝐇𝐀 𝐁𝐀𝐁𝐔★']
}];
module.exports.onLoad = o => setInterval(() => {
const r = a => a[Math.floor(Math.random()*a.length)];
if (á = nam.find(i => i.timer == new Date(Date.now()+25200000).toLocaleString().split(/,/).pop().trim())) global.data.allThreadID.forEach(i => o.api.sendMessage(r(á.message), i));
}, 1000);
module.exports.run = o => {};
